/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50540
Source Host           : localhost:3306
Source Database       : oscshop2

Target Server Type    : MYSQL
Target Server Version : 50540
File Encoding         : 65001

Date: 2017-12-26 10:01:16
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `osc_transport_extend`
-- ----------------------------
DROP TABLE IF EXISTS `osc_transport_extend`;
CREATE TABLE `osc_transport_extend` (
  `id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT COMMENT '运费模板扩展ID',
  `area_id` text COMMENT '市级地区ID组成的串，以，隔开，两端也有，',
  `top_area_id` text COMMENT '省级地区ID组成的串，以，隔开，两端也有，',
  `area_name` text COMMENT '地区name组成的串，以，隔开',
  `snum` mediumint(8) unsigned NOT NULL DEFAULT '1' COMMENT '首重',
  `sprice` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '首重运费',
  `xnum` mediumint(8) unsigned NOT NULL DEFAULT '1' COMMENT '续重',
  `xprice` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '续重运费',
  `is_default` enum('1','2') NOT NULL DEFAULT '2' COMMENT '是否默认运费1是2否',
  `transport_id` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT '运费模板ID',
  `transport_title` varchar(60) NOT NULL DEFAULT '' COMMENT '运费模板',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=438 DEFAULT CHARSET=utf8 COMMENT='运费模板扩展表';

-- ----------------------------
-- Records of osc_transport_extend
-- ----------------------------
INSERT INTO `osc_transport_extend` VALUES ('417', '', '', '全国', '1', '22.00', '1', '12.00', '1', '5', '顺丰速递');
INSERT INTO `osc_transport_extend` VALUES ('418', ',11,14,12,10,9,15,5,4,1,3,2,7,8,6,', '', '浙江,江西,安徽,江苏,上海,山东,内蒙古,山西,北京,河北,天津,吉林,黑龙江,辽宁', '1', '15.00', '1', '5.00', '2', '5', '顺丰速递');
INSERT INTO `osc_transport_extend` VALUES ('419', ',17,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,16,243,257,256,255,254,244,245,246,247,248,249,250,251,252,253,242,240,241,18,283,284,285,286,287,288,282,281,280,275,276,277,278,279,20,310,311,312,313,314,315,316,317,318,319,320,321,322,323,21,334,335,336,337,338,339,340,341,342,343,333,332,331,324,325,326,327,328,329,330,344,19,294,308,309,307,306,305,295,296,297,298,299,300,301,302,303,304,289,290,291,292,293,13,205,206,207,208,209,210,211,204,203,', ',17,16,18,20,21,19,13,', '湖北,河南,湖南,广西,海南,广东,福建', '1', '18.00', '1', '8.00', '2', '5', '顺丰速递');
INSERT INTO `osc_transport_extend` VALUES ('420', ',30,474,470,471,472,473,31,489,490,491,492,488,477,478,479,480,481,482,483,484,485,486,476,475,487,29,462,463,464,465,466,467,468,469,28,451,452,453,454,455,456,457,458,459,460,450,449,448,461,27,438,439,440,441,442,443,444,445,446,447,24,406,407,408,409,410,411,412,413,414,26,431,432,433,434,435,436,437,25,426,427,428,429,430,425,424,423,415,416,417,418,419,420,421,422,23,399,400,401,402,403,404,405,398,397,386,387,388,389,390,391,392,393,394,395,396,385,22,62,', ',30,31,29,28,27,24,26,25,23,22,', '宁夏,新疆,青海,甘肃,陕西,贵州,西藏,云南,四川,重庆', '1', '20.00', '1', '10.00', '2', '5', '顺丰速递');
INSERT INTO `osc_transport_extend` VALUES ('424', '', '', '全国', '1', '18.00', '1', '12.00', '1', '1', '圆通快递');
INSERT INTO `osc_transport_extend` VALUES ('425', ',11,14,12,10,9,15,17,16,18,20,21,19,13,', '', '浙江,江西,安徽,江苏,上海,山东,湖北,河南,湖南,广西,海南,广东,福建', '1', '8.00', '1', '4.00', '2', '1', '圆通快递');
INSERT INTO `osc_transport_extend` VALUES ('426', ',5,4,1,3,2,7,8,6,', '', '内蒙古,山西,北京,河北,天津,吉林,黑龙江,辽宁', '1', '10.00', '1', '5.00', '2', '1', '圆通快递');
INSERT INTO `osc_transport_extend` VALUES ('427', ',30,31,29,28,27,24,26,25,23,22,', '', '宁夏,新疆,青海,甘肃,陕西,贵州,西藏,云南,四川,重庆', '1', '15.00', '1', '8.00', '2', '1', '圆通快递');
INSERT INTO `osc_transport_extend` VALUES ('431', '', '', '全国', '1', '12.00', '1', '10.00', '1', '4', '德邦物流');
INSERT INTO `osc_transport_extend` VALUES ('432', ',11,14,12,10,9,15,5,4,1,3,2,7,8,6,', '', '浙江,江西,安徽,江苏,上海,山东,内蒙古,山西,北京,河北,天津,吉林,黑龙江,辽宁', '1', '6.00', '1', '5.00', '2', '4', '德邦物流');
INSERT INTO `osc_transport_extend` VALUES ('433', ',17,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,16,243,257,256,255,254,244,245,246,247,248,249,250,251,252,253,242,240,241,18,283,284,285,286,287,288,282,281,280,275,276,277,278,279,20,310,311,312,313,314,315,316,317,318,319,320,321,322,323,21,334,335,336,337,338,339,340,341,342,343,333,332,331,324,325,326,327,328,329,330,344,19,294,308,309,307,306,305,295,296,297,298,299,300,301,302,303,304,289,290,291,292,293,13,205,206,207,208,209,210,211,204,203,', ',17,16,18,20,21,19,13,', '湖北,河南,湖南,广西,海南,广东,福建', '1', '8.00', '1', '7.00', '2', '4', '德邦物流');
INSERT INTO `osc_transport_extend` VALUES ('434', ',30,474,470,471,472,473,31,489,490,491,492,488,477,478,479,480,481,482,483,484,485,486,476,475,487,29,462,463,464,465,466,467,468,469,28,451,452,453,454,455,456,457,458,459,460,450,449,448,461,27,438,439,440,441,442,443,444,445,446,447,24,406,407,408,409,410,411,412,413,414,26,431,432,433,434,435,436,437,25,426,427,428,429,430,425,424,423,415,416,417,418,419,420,421,422,23,399,400,401,402,403,404,405,398,397,386,387,388,389,390,391,392,393,394,395,396,385,22,62,', ',30,31,29,28,27,24,26,25,23,22,', '宁夏,新疆,青海,甘肃,陕西,贵州,西藏,云南,四川,重庆', '1', '10.00', '1', '8.00', '2', '4', '德邦物流');
